## Terragrunt plan
```
[90m02:37:09.124 [0mSTDOUT [36mterraform: [0m[0m[1mInitializing the backend...[0m[0m
[90m02:37:09.634 [0mSTDOUT [36mterraform: [0m[0m[32m[0m
[90m02:37:09.634 [0mSTDOUT [36mterraform: [0mSuccessfully configured the backend "s3"! Terraform will automatically
[90m02:37:09.634 [0mSTDOUT [36mterraform: [0muse this backend unless the backend configuration changes.[0m[0m
[90m02:37:09.822 [0mSTDOUT [36mterraform: [0m[0m[1mInitializing modules...[0m[0m
[90m02:37:09.833 [0mSTDOUT [36mterraform: [0m- observability in modules/observability
[90m02:37:09.836 [0mSTDOUT [36mterraform: [0m- recovery in modules/recovery
[90m02:37:09.838 [0mSTDOUT [36mterraform: [0m[0m[1mInitializing provider plugins...[0m[0m
[90m02:37:09.838 [0mSTDOUT [36mterraform: [0m- Finding latest version of hashicorp/aws...
[90m02:37:10.188 [0mSTDOUT [36mterraform: [0m- Installing hashicorp/aws v6.36.0...
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0m- Installed hashicorp/aws v6.36.0 (signed by HashiCorp)
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mTerraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider[0m
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mselections it made above. Include this file in your version control repository
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mso that Terraform can guarantee to make the same selections by default when
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0myou run "terraform init" in the future.[0m[0m
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0m[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m[0m
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0m[0m[32m[0m
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mYou may now begin working with Terraform. Try running "terraform plan" to see
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0many changes that are required for your infrastructure. All Terraform commands
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mshould now work.
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mIf you ever set or change modules or backend configuration for Terraform,
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mrerun this command to reinitialize your working directory. If you forget, other
[90m02:37:15.408 [0mSTDOUT [36mterraform: [0mcommands will detect it and remind you to do so if necessary.[0m[0m
[90m02:37:19.752 [0mSTDOUT [36mterraform: [0m[0m[1mmodule.recovery.data.aws_caller_identity.current: Reading...[0m[0m[0m
[90m02:37:19.752 [0mSTDOUT [36mterraform: [0m[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m[0m
[90m02:37:19.752 [0mSTDOUT [36mterraform: [0m[0m[1mdata.aws_ami.windows_2022: Reading...[0m[0m[0m
[90m02:37:19.765 [0mSTDOUT [36mterraform: [0m[0m[1mmodule.recovery.data.aws_subnet.recovery_subnet[0]: Reading...[0m[0m[0m
[90m02:37:19.813 [0mSTDOUT [36mterraform: [0m[0m[1mmodule.recovery.data.aws_caller_identity.current: Read complete after 0s [id=550192603632][0m[0m
[90m02:37:19.865 [0mSTDOUT [36mterraform: [0m[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=550192603632][0m[0m
[90m02:37:20.107 [0mSTDOUT [36mterraform: [0m[0m[1mmodule.recovery.data.aws_subnet.recovery_subnet[0]: Read complete after 0s [id=subnet-0ad9bdbfb62dcfcca][0m[0m
[90m02:37:20.285 [0mSTDOUT [36mterraform: [0m[0m[1mdata.aws_ami.windows_2022: Read complete after 0s [id=ami-05856bd26dd466893][0m[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0mTerraform used the selected providers to generate the following execution
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m  [32m+[0m create[0m[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0mTerraform will perform the following actions:
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[1m  # aws_cloudwatch_log_group.brainctl[0][0m will be created[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "brainctl" {[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m arn                         = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m deletion_protection_enabled = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m id                          = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m kms_key_id                  = "alias/brainctl-logs"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m log_group_class             = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m name                        = "/brainctl/brain-teste-4/dev"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m name_prefix                 = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m region                      = "us-east-1"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m retention_in_days           = 14[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m skip_destroy                = false[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags                        = {[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "/brainctl/brain-teste-4/dev"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags_all                    = {[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "/brainctl/brain-teste-4/dev"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m    }
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[1m  # aws_iam_instance_profile.ec2_cw_profile[0][0m will be created[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "ec2_cw_profile" {[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m arn         = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m create_date = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m id          = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m name        = "brain-teste-4-dev-cw-profile"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m name_prefix = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m path        = "/"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m role        = "brain-teste-4-dev-cw-role"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags_all    = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m unique_id   = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m    }
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[1m  # aws_iam_role.ec2_cw_role[0][0m will be created[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_iam_role" "ec2_cw_role" {[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m arn                   = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m assume_role_policy    = jsonencode([0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m            {
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m              [32m+[0m[0m Statement = [[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                  [32m+[0m[0m {[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                      [32m+[0m[0m Action    = "sts:AssumeRole"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                      [32m+[0m[0m Effect    = "Allow"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                      [32m+[0m[0m Principal = {[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                          [32m+[0m[0m Service = "ec2.amazonaws.com"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                        }
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                    },
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m                ]
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m              [32m+[0m[0m Version   = "2012-10-17"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m        )
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m create_date           = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m force_detach_policies = false[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m id                    = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m managed_policy_arns   = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m max_session_duration  = 3600[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m name                  = "brain-teste-4-dev-cw-role"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m name_prefix           = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m path                  = "/"[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags_all              = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m unique_id             = (known after apply)[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m    }
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[1m  # aws_iam_role_policy_attachment.ec2_cw_agent[0][0m will be created[0m
[90m02:37:20.541 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ec2_cw_agent" {[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m id         = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m role       = "brain-teste-4-dev-cw-role"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m    }
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m[1m  # aws_iam_role_policy_attachment.ec2_ssm_managed[0][0m will be created[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ec2_ssm_managed" {[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m id         = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m role       = "brain-teste-4-dev-cw-role"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m    }
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m[1m  # aws_instance.app[0][0m will be created[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_instance" "app" {[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ami                                  = "ami-0fc40e7f26d89dac6"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m arn                                  = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m associate_public_ip_address          = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m availability_zone                    = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m disable_api_stop                     = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m disable_api_termination              = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ebs_optimized                        = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m force_destroy                        = false[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m get_password_data                    = false[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m host_id                              = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m host_resource_group_arn              = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m iam_instance_profile                 = "brain-teste-4-dev-cw-profile"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m id                                   = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_lifecycle                   = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_state                       = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_type                        = "t3.micro"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ipv6_address_count                   = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ipv6_addresses                       = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m key_name                             = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m monitoring                           = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m outpost_arn                          = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m password_data                        = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m placement_group                      = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m placement_group_id                   = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m placement_partition_number           = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m primary_network_interface_id         = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m private_dns                          = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m private_ip                           = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m public_dns                           = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m public_ip                            = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m region                               = "us-east-1"[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m secondary_private_ips                = (known after apply)[0m
[90m02:37:20.542 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m security_groups                      = (known after apply)[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m source_dest_check                    = true[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m spot_instance_request_id             = (known after apply)[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m subnet_id                            = "subnet-0ad9bdbfb62dcfcca"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags                                 = {[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "brain-teste-4-dev"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Role"        = "app"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags_all                             = {[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "brain-teste-4-dev"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Role"        = "app"[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tenancy                              = (known after apply)[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m user_data                            = <<-EOT[0m
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            <powershell>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            $ErrorActionPreference = "Stop"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            $brainctlLogPath = "C:\ProgramData\Amazon\EC2Launch\log\brainctl-userdata.log"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            function Write-BrainctlLog([string]$message) {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              $ts = (Get-Date).ToString("yyyy-MM-dd HH:mm:ss")
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              Add-Content -Path $brainctlLogPath -Value "$ts [APP] $message"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            Write-BrainctlLog "Starting CloudWatch bootstrap"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            New-Item -ItemType Directory -Force -Path "C:\ProgramData\Amazon\AmazonCloudWatchAgent" | Out-Null
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            $utf8NoBom = New-Object System.Text.UTF8Encoding($false)
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            $jsonContent = @'
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            {"agent":{"metrics_collection_interval":60},"logs":{"logs_collected":{"files":{"collect_list":[{"file_path":"C:\\inetpub\\logs\\LogFiles\\W3SVC*\\*.log","log_group_name":"/brainctl/brain-teste-4/dev","log_stream_name":"brain-teste-4-dev-app/iis","timezone":"UTC"}]},"windows_events":{"collect_list":[{"event_levels":["ERROR","WARNING","CRITICAL"],"event_name":"System","log_group_name":"/brainctl/brain-teste-4/dev","log_stream_name":"brain-teste-4-dev-app/system"}]}}},"metrics":{"append_dimensions":{"InstanceId":"${aws:InstanceId}"},"metrics_collected":{"LogicalDisk":{"measurement":["% Free Space"],"resources":["*"]},"Memory":{"measurement":["% Committed Bytes In Use"]},"TCPv4":{"measurement":[{"name":"Connections Established","rename":"tcp_connections_established","unit":"Count"}]}},"namespace":"BrainCTL/brain-teste-4/dev"},"processors":{"transform":{"metric_statements":["set(metric.unit, \"Percent\") where metric.name == \"Memory % Committed Bytes In Use\"","set(metric.name, \"mem_used_percent\") where metric.name == \"Memory % Committed Bytes In Use\""]}}}
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            '@
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            [System.IO.File]::WriteAllText(
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              "C:\ProgramData\Amazon\AmazonCloudWatchAgent\config.json",
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              $jsonContent,
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              $utf8NoBom
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            )
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            $cwCtl = "C:\Program Files\Amazon\AmazonCloudWatchAgent\amazon-cloudwatch-agent-ctl.ps1"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            if (Test-Path $cwCtl) {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              try {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                & $cwCtl -a fetch-config -m ec2 -s -c file:"C:\ProgramData\Amazon\AmazonCloudWatchAgent\config.json"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                Write-BrainctlLog "CloudWatch Agent bootstrap completed"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              catch {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                Write-BrainctlLog "CloudWatch Agent bootstrap failed but provisioning will continue: $($_.Exception.Message)"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            else {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              Write-BrainctlLog "CloudWatch Agent bootstrap skipped (agent not present in AMI)"
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            $pageHtml = @'
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            <!doctype html>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            <html lang="pt-BR">
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              <head>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                <meta charset="utf-8" />
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                <meta name="viewport" content="width=device-width, initial-scale=1" />
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                <title>brainctl | Infraestrutura como Produto</title>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                <style>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  :root {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --bg: #070b17;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --bg-soft: #0f172a;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --card: #111a30cc;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --line: #334155;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --text: #e2e8f0;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --muted: #94a3b8;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --accent: #38bdf8;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --accent-2: #818cf8;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    --ok: #22c55f;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  * { box-sizing: border-box; }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  html, body { margin: 0; }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  body {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-family: "Segoe UI", Inter, system-ui, -apple-system, sans-serif;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    color: var(--text);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    background:
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                      radial-gradient(circle at 10% 10%, #1e293b 0%, transparent 45%),
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                      radial-gradient(circle at 90% 20%, #1d4ed8 0%, transparent 35%),
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                      linear-gradient(160deg, #020617 0%, #0b1120 60%, #020617 100%);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .container { width: min(1100px, 92vw); margin: 0 auto; }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .hero {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    padding: 58px 0 26px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .tag {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    display: inline-block;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    padding: 8px 14px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border: 1px solid #334155;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border-radius: 999px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-size: 12px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    letter-spacing: .08em;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    text-transform: uppercase;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    color: #cbd5e1;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    background: rgba(15, 23, 42, .75);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  h1 {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    margin: 18px 0 14px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-size: clamp(34px, 6vw, 64px);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    line-height: 1.05;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    letter-spacing: -0.03em;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .brand {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    background: linear-gradient(90deg, var(--accent-2), var(--accent));
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    -webkit-background-clip: text;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    background-clip: text;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    color: transparent;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .lead {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    margin: 0;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    max-width: 860px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    color: var(--muted);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-size: clamp(16px, 2.1vw, 20px);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    line-height: 1.55;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .grid {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    display: grid;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    gap: 18px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    grid-template-columns: repeat(auto-fit, minmax(240px, 1fr));
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    margin: 28px 0 12px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .card {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border: 1px solid rgba(148, 163, 184, .25);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    background: var(--card);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border-radius: 18px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    padding: 18px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    backdrop-filter: blur(6px);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .card h3 {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    margin: 0 0 8px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-size: 16px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .card p { margin: 0; color: var(--muted); line-height: 1.45; font-size: 14px; }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .section {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    margin-top: 24px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border: 1px solid rgba(148, 163, 184, .22);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    background: rgba(15, 23, 42, .62);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border-radius: 18px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    padding: 20px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .section h2 { margin: 0 0 14px; font-size: 22px; }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .cols {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    display: grid;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    grid-template-columns: repeat(auto-fit, minmax(280px, 1fr));
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    gap: 16px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  ul { margin: 0; padding-left: 18px; }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  li { margin-bottom: 8px; color: #cbd5e1; }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .flow {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    margin-top: 12px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    padding: 12px 14px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border-radius: 12px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    border: 1px dashed rgba(56, 189, 248, .4);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    background: rgba(15, 23, 42, .55);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    color: #bae6fd;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-family: ui-monospace, SFMono-Regular, Menlo, Consolas, monospace;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-size: 13px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .footer {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    margin: 26px 0 34px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    color: #93c5fd;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-size: 13px;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  .ok {
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    color: var(--ok);
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    font-weight: 600;
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  }
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                </style>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              </head>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m              <body>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                <main class="container">
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                  <section class="hero">
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    <span class="tag">Platform Engineering</span>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    <h1><span class="brand">brainctl</span> • Infraestrutura como Produto</h1>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    <p class="lead">
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                      Este ambiente foi provisionado com brainctl para demonstrar um portfólio real de automação AWS com governança, observabilidade e recuperação de desastre.
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                      O objetivo é acelerar entrega de negócio com padrão operacional confiável.
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    </p>
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                    <div class="grid">
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                      <article class="card">
[90m02:37:20.543 [0mSTDOUT [36mterraform: [0m                        <h3>Provisionamento padronizado</h3>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <p>Ambientes seguem contrato YAML com validações, reduzindo erros manuais e retrabalho.</p>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      </article>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      <article class="card">
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <h3>Escala e resiliência</h3>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <p>ALB, Auto Scaling e monitoração contínua para manter disponibilidade da aplicação.</p>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      </article>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      <article class="card">
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <h3>Observabilidade orientada a ação</h3>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <p>Dashboards, alarmes e Session Manager para diagnóstico rápido sem depender de RDP aberto.</p>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      </article>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      <article class="card">
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <h3>Recovery + DR Drill mensal</h3>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <p>Snapshots, runbooks de restore e simulação recorrente de recuperação para validar prontidão.</p>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      </article>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    </div>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                  </section>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                  <section class="section">
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    <h2>Resumo da arquitetura da solução</h2>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    <div class="cols">
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      <div>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <ul>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>CLI em Go:</strong> interpreta o contrato declarativo e aplica guardrails de segurança.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>Gerador Terraform:</strong> constrói workspace e módulos AWS de forma consistente.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>Blueprint ec2-app:</strong> app, db opcional, load balancer e autoscaling.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>Observabilidade:</strong> métricas, alarmes e trilha de operação com CloudWatch/SNS.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        </ul>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      </div>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      <div>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        <ul>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>Recovery:</strong> snapshots automáticos e runbooks para recuperação controlada.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>DR Drill:</strong> agenda mensal com EventBridge Scheduler + SSM Automation.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>Governança:</strong> arquivos YAML por SG para customização segura.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                          <li><strong>Status operacional:</strong> outputs claros para times técnicos e de produto.</li>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                        </ul>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                      </div>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    </div>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    <div class="flow">app.yaml (+security-groups/*.yaml) → validação (Go) → geração Terraform → AWS pronta para operação</div>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                  </section>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                  <p class="footer">
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    <span class="ok">● ambiente ativo</span> | Portfolio brainctl | AWS + Terraform + Go
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                  </p>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                </main>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m              </body>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            </html>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            '@
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            $ErrorActionPreference = "Stop"
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            # Log do bootstrap
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            $logPath = "C:\ProgramData\brainctl-iis-setup.log"
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            New-Item -ItemType Directory -Force -Path (Split-Path $logPath) | Out-Null
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            Start-Transcript -Path $logPath -Append
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            try {
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                Install-WindowsFeature -Name Web-Server -IncludeManagementTools | Out-Null
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                $webRoot = "C:\inetpub\wwwroot"
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                New-Item -ItemType Directory -Force -Path $webRoot | Out-Null
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                # --- Correção 1: desfaz encoding quebrado (Ã§ / â€¢ / â†’ etc) ---
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                $pageHtmlFixed = [System.Text.Encoding]::UTF8.GetString(
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    [System.Text.Encoding]::GetEncoding(1252).GetBytes($pageHtml)
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                )
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                # Gravar index.html em UTF-8 sem BOM
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                $indexPath = Join-Path $webRoot "index.html"
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                [System.IO.File]::WriteAllText($indexPath, $pageHtmlFixed, (New-Object System.Text.UTF8Encoding($false)))
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                # --- Correção 2: web.config com remoção de header duplicado + utf-8 ---
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                $webConfigContent = @"
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            <?xml version="1.0" encoding="utf-8"?>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            <configuration>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m              <system.webServer>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                <httpProtocol>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                  <customHeaders>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    <remove name="Content-Type" />
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                    <add name="Content-Type" value="text/html; charset=utf-8" />
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                  </customHeaders>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                </httpProtocol>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m              </system.webServer>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            </configuration>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            "@
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                $webConfigPath = Join-Path $webRoot "web.config"
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                [System.IO.File]::WriteAllText($webConfigPath, $webConfigContent, (New-Object System.Text.UTF8Encoding($false)))
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                # (Opcional) garantir que o Default Web Site aponte para o webroot esperado
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                Import-Module WebAdministration
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                Set-ItemProperty "IIS:\Sites\Default Web Site" -Name physicalPath -Value $webRoot
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                # Reinicia IIS de forma confiável
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                iisreset | Out-Null
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                # Validação simples sem depender do motor do IE
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                $resp = Invoke-WebRequest "http://localhost/" -UseBasicParsing
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                Add-Content -Path $logPath -Value ("StatusCode: " + $resp.StatusCode)
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                Add-Content -Path $logPath -Value ("Content-Type: " + $resp.Headers["Content-Type"])
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            catch {
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                Add-Content -Path $logPath -Value ("ERRO: " + $_.Exception.Message)
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                throw
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            finally {
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m                Stop-Transcript | Out-Null
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m            </powershell>
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m        EOT
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m user_data_base64                     = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m user_data_replace_on_change          = false[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m volume_tags                          = {[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "App"         = "brain-teste-4"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "BackupScope" = "app"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "brain-teste-4-dev-app-root"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m vpc_security_group_ids               = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m metadata_options {[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_endpoint               = "enabled"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_protocol_ipv6          = "disabled"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_put_response_hop_limit = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_tokens                 = "required"[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m instance_metadata_tags      = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m root_block_device {[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m delete_on_termination = true[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m device_name           = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m encrypted             = true[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m iops                  = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m kms_key_id            = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m tags_all              = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m throughput            = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m volume_id             = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m volume_size           = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m volume_type           = (known after apply)[0m
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.544 [0mSTDOUT [36mterraform: [0m    }
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m[1m  # aws_instance.db[0][0m will be created[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_instance" "db" {[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ami                                  = "ami-0fc40e7f26d89dac6"[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m arn                                  = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m associate_public_ip_address          = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m availability_zone                    = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m disable_api_stop                     = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m disable_api_termination              = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ebs_optimized                        = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m force_destroy                        = false[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m get_password_data                    = false[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m host_id                              = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m host_resource_group_arn              = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m iam_instance_profile                 = "brain-teste-4-dev-cw-profile"[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m id                                   = (known after apply)[0m
[90m02:37:20.545 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_lifecycle                   = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_state                       = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m instance_type                        = "t3.micro"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ipv6_address_count                   = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ipv6_addresses                       = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m key_name                             = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m monitoring                           = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m outpost_arn                          = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m password_data                        = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m placement_group                      = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m placement_group_id                   = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m placement_partition_number           = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m primary_network_interface_id         = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m private_dns                          = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m private_ip                           = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m public_dns                           = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m public_ip                            = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m region                               = "us-east-1"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m secondary_private_ips                = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m security_groups                      = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m source_dest_check                    = true[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m spot_instance_request_id             = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m subnet_id                            = "subnet-0ad9bdbfb62dcfcca"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags                                 = {[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "brain-teste-4-dev-db"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Role"        = "db"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tags_all                             = {[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "brain-teste-4-dev-db"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Role"        = "db"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m tenancy                              = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m user_data                            = <<-EOT[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            <powershell>
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            $ErrorActionPreference = "Stop"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            $brainctlLogPath = "C:\ProgramData\Amazon\EC2Launch\log\brainctl-userdata.log"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            function Write-BrainctlLog([string]$message) {
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m              $ts = (Get-Date).ToString("yyyy-MM-dd HH:mm:ss")
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m              Add-Content -Path $brainctlLogPath -Value "$ts [DB] $message"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            Write-BrainctlLog "Starting CloudWatch bootstrap"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            New-Item -ItemType Directory -Force -Path "C:\ProgramData\Amazon\AmazonCloudWatchAgent" | Out-Null
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            @'
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            {"agent":{"metrics_collection_interval":60},"logs":{"logs_collected":{"windows_events":{"collect_list":[{"event_levels":["ERROR","WARNING","CRITICAL"],"event_name":"Application","log_group_name":"/brainctl/brain-teste-4/dev","log_stream_name":"brain-teste-4-dev-db/application"}]}}},"metrics":{"append_dimensions":{"InstanceId":"${aws:InstanceId}"},"metrics_collected":{"LogicalDisk":{"measurement":["% Free Space"],"resources":["*"]},"Memory":{"measurement":["% Committed Bytes In Use"]}},"namespace":"BrainCTL/brain-teste-4/dev"},"processors":{"transform":{"metric_statements":["set(metric.unit, \"Percent\") where metric.name == \"Memory % Committed Bytes In Use\"","set(metric.name, \"mem_used_percent\") where metric.name == \"Memory % Committed Bytes In Use\""]}}}
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            '@ | Set-Content -Path "C:\ProgramData\Amazon\AmazonCloudWatchAgent\config.json" -Encoding UTF8
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            $cwCtl = "C:\Program Files\Amazon\AmazonCloudWatchAgent\amazon-cloudwatch-agent-ctl.ps1"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            if (Test-Path $cwCtl) {
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m              try {
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m                & $cwCtl -a fetch-config -m ec2 -s -c file:"C:\ProgramData\Amazon\AmazonCloudWatchAgent\config.json"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m                Write-BrainctlLog "CloudWatch Agent bootstrap completed"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m              }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m              catch {
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m                Write-BrainctlLog "CloudWatch Agent bootstrap failed but provisioning will continue: $($_.Exception.Message)"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m              }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            else {
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m              Write-BrainctlLog "CloudWatch Agent bootstrap skipped (agent not present in AMI)"
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m            </powershell>
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m        EOT
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m user_data_base64                     = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m user_data_replace_on_change          = false[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m volume_tags                          = {[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "App"         = "brain-teste-4"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "BackupScope" = "db"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Environment" = "dev"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "ManagedBy"   = "brainctl"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m "Name"        = "brain-teste-4-dev-db-root"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m vpc_security_group_ids               = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m metadata_options {[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_endpoint               = "enabled"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_protocol_ipv6          = "disabled"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_put_response_hop_limit = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m http_tokens                 = "required"[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m instance_metadata_tags      = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m root_block_device {[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m delete_on_termination = true[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m device_name           = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m encrypted             = true[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m iops                  = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m kms_key_id            = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m tags_all              = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m throughput            = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m volume_id             = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m volume_size           = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m          [32m+[0m[0m volume_type           = (known after apply)[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m        }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m    }
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m[1m  # aws_lb.app_alb[0][0m will be created[0m
[90m02:37:20.546 [0mSTDOUT [36mterraform: [0m[0m  [32m+[0m[0m resource "aws_lb" "app_alb" {[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m arn                                                          = (known after apply)[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m arn_suffix                                                   = (known after apply)[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m client_keep_alive                                            = 3600[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m desync_mitigation_mode                                       = "defensive"[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m dns_name                                                     = (known after apply)[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m drop_invalid_header_fields                                   = false[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m enable_deletion_protection                                   = false[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m enable_http2                                                 = true[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m enable_tls_version_and_cipher_suite_headers                  = false[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m enable_waf_fail_open                                         = false[0m
[90m02:37:20.547 [0mSTDOUT [36mterraform: [0m      [32m+[0m[0m ena
```